###############################################################
#  Generated by:      Cadence Innovus 21.18-s099_1
#  OS:                Linux x86_64(Host ID vlsi)
#  Generated on:      Tue Jun 16 05:03:23 2026
#  Design:            SYS_TOP
#  Command:           saveDesign ./saved_design/final_fix_drv_timing.inn
###############################################################
current_design SYS_TOP
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {UART_CLK}]  -name UART_RX_CLK -period 100.000000 -waveform {0.000000 50.000000}
set_propagated_clock  [get_clocks {UART_RX_CLK}]
set_max_transition -clock_path 0.75  [get_clocks {UART_RX_CLK}]
set_max_transition -data_path 1.5  [get_clocks {UART_RX_CLK}]
create_clock [get_ports {REF_CLK}]  -name REF_CLK -period 5.000000 -waveform {0.000000 2.500000}
set_propagated_clock  [get_clocks {REF_CLK}]
set_max_transition -clock_path 0.75  [get_clocks {REF_CLK}]
set_max_transition -data_path 1.5  [get_clocks {REF_CLK}]
set_clock_transition  -rise -min 0.1 [get_clocks {REF_CLK}]
set_clock_transition  -rise -max 0.1 [get_clocks {REF_CLK}]
set_clock_transition  -fall -min 0.1 [get_clocks {REF_CLK}]
set_clock_transition  -fall -max 0.1 [get_clocks {REF_CLK}]
create_generated_clock -name UART_TX_CLK -source [get_ports {UART_CLK}] -divide_by 8 -master_clock [get_clocks {UART_RX_CLK}] -add [get_pins {U0_ClkDiv/o_div_clk}]
create_generated_clock -name ALU_CLK -source [get_ports {REF_CLK}] -divide_by 1 -master_clock [get_clocks {REF_CLK}] -add [get_pins {U0_CLK_GATE/GATED_CLK}]
set_propagated_clock  [get_pins {U0_CLK_GATE/GATED_CLK}]
set_propagated_clock  [get_pins {U0_ClkDiv/o_div_clk}]
set_propagated_clock  [get_ports {UART_CLK}]
set_propagated_clock  [get_ports {REF_CLK}]
set_propagated_clock  [get_clocks {ALU_CLK}]
set_max_transition -clock_path 0.75  [get_clocks {ALU_CLK}]
set_max_transition -data_path 1.5  [get_clocks {ALU_CLK}]
set_propagated_clock  [get_clocks {UART_TX_CLK}]
set_max_transition -clock_path 0.75  [get_clocks {UART_TX_CLK}]
set_max_transition -data_path 1.5  [get_clocks {UART_TX_CLK}]
set_wire_load_mode enclosed
set_max_capacitance 0.1  [get_designs {SYS_TOP}]
set_max_fanout 30  [get_designs {SYS_TOP}]
set_input_delay -add_delay 2 -clock [get_clocks {UART_RX_CLK}] [get_ports {UART_RX_IN}]
set_output_delay -add_delay 2 -clock [get_clocks {UART_RX_CLK}] [get_ports {UART_TX_O}]
set_clock_uncertainty 0.07 -hold [get_clocks {ALU_CLK}]
set_clock_uncertainty 0.5 -setup [get_clocks {ALU_CLK}]
set_clock_uncertainty 0.07 -hold [get_clocks {UART_TX_CLK}]
set_clock_uncertainty 0.5 -setup [get_clocks {UART_TX_CLK}]
set_clock_uncertainty 0.07 -hold [get_clocks {REF_CLK}]
set_clock_uncertainty 0.5 -setup [get_clocks {REF_CLK}]
set_clock_uncertainty 0.07 -hold [get_clocks {UART_RX_CLK}]
set_clock_uncertainty 0.5 -setup [get_clocks {UART_RX_CLK}]
set __coll_2 [get_pins {U0_CLK_GATE/Latch_Out_reg/GN U0_ClkDiv/CLK_FLAG_reg/CK {U0_ClkDiv/counter_reg[0]/CK} {U0_ClkDiv/counter_reg[1]/CK} {U0_ClkDiv/counter_reg[5]/CK} {U0_ClkDiv/counter_reg[7]/CK} U0_ClkDiv/div_clk_reg/CK {U0_ClkDiv/counter_reg[2]/CK} {U0_ClkDiv/counter_reg[6]/CK} {U0_ClkDiv/counter_reg[4]/CK} {U0_ClkDiv/counter_reg[3]/CK} {U0_ALU_ALU_OUT_reg[0]/CK} {U0_ALU_ALU_OUT_reg[1]/CK} {U0_ALU_ALU_OUT_reg[2]/CK} {U0_ALU_ALU_OUT_reg[3]/CK} {U0_ALU_ALU_OUT_reg[4]/CK} {U0_ALU_ALU_OUT_reg[5]/CK} {U0_ALU_ALU_OUT_reg[6]/CK} {U0_ALU_ALU_OUT_reg[7]/CK} {U0_ALU_ALU_OUT_reg[8]/CK} {U0_ALU_ALU_OUT_reg[9]/CK} {U0_ALU_ALU_OUT_reg[10]/CK} {U0_ALU_ALU_OUT_reg[11]/CK} {U0_ALU_ALU_OUT_reg[12]/CK} {U0_ALU_ALU_OUT_reg[13]/CK} {U0_ALU_ALU_OUT_reg[14]/CK} {U0_ALU_ALU_OUT_reg[15]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_G_rptr_reg[1]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_G_rptr_reg[2]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_G_rptr_reg[3]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_G_wptr_reg[1]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_G_wptr_reg[2]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_G_wptr_reg[3]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[0][0]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[0][1]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[1][0]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[2][0]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[2][1]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[3][0]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[3][1]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[0][0]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[0][1]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[1][0]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[1][1]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[2][0]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[2][1]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[3][0]/CK} {U0_ASYNC_FIFO_U_W2R_SYNC_SYNC_reg_reg[3][1]/CK} U0_PULSE_GEN_reg_SIG_0_reg/CK U0_PULSE_GEN_reg_SIG_1_reg/CK {U0_RST_SYNC_RST_reg_reg[0]/CK} {U0_RST_SYNC_RST_reg_reg[1]/CK} {U0_ref_Data_sync_en_reg_reg[0]/CK} {U0_ref_Data_sync_en_reg_reg[1]/CK} {U1_RST_SYNC_RST_reg_reg[0]/CK} {U1_RST_SYNC_RST_reg_reg[1]/CK} U0_ALU_OUT_VALID_reg/CK {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[0][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[1][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[2][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[3][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[4][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[5][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[6][7]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][0]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][1]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][2]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][3]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][4]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][5]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][6]/CK} {U0_ASYNC_FIFO_U_FIFO_MEM_FIFO_MEM_reg[7][7]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_G_rptr_reg[0]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_inter_addr_reg[0]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_inter_addr_reg[2]/CK} {U0_ASYNC_FIFO_U_FIFO_RD_inter_addr_reg[3]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_G_wptr_reg[0]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_inter_addr_reg[0]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_inter_addr_reg[1]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_inter_addr_reg[2]/CK} {U0_ASYNC_FIFO_U_FIFO_WR_inter_addr_reg[3]/CK} {U0_ASYNC_FIFO_U_R2W_SYNC_SYNC_reg_reg[1][1]/CK} {U0_RegFile_REG_FILE_reg[0][0]/CK} {U0_RegFile_REG_FILE_reg[0][1]/CK} {U0_RegFile_REG_FILE_reg[0][2]/CK} {U0_RegFile_REG_FILE_reg[0][4]/CK} {U0_RegFile_REG_FILE_reg[0][6]/CK} {U0_RegFile_REG_FILE_reg[1][7]/CK} {U0_RegFile_REG_FILE_reg[2][1]/CK} {U0_RegFile_REG_FILE_reg[2][2]/CK} {U0_RegFile_REG_FILE_reg[2][3]/CK} {U0_RegFile_REG_FILE_reg[2][4]/CK} {U0_RegFile_REG_FILE_reg[2][5]/CK} {U0_RegFile_REG_FILE_reg[2][6]/CK} {U0_RegFile_REG_FILE_reg[2][7]/CK} {U0_RegFile_REG_FILE_reg[3][0]/CK} {U0_RegFile_REG_FILE_reg[3][1]/CK} {U0_RegFile_REG_FILE_reg[3][2]/CK} {U0_RegFile_REG_FILE_reg[3][3]/CK} {U0_RegFile_REG_FILE_reg[3][4]/CK} {U0_RegFile_REG_FILE_reg[3][5]/CK} {U0_RegFile_REG_FILE_reg[3][6]/CK} {U0_RegFile_REG_FILE_reg[3][7]/CK} {U0_RegFile_REG_FILE_reg[4][0]/CK} {U0_RegFile_REG_FILE_reg[4][1]/CK} {U0_RegFile_REG_FILE_reg[4][2]/CK} {U0_RegFile_REG_FILE_reg[4][3]/CK} {U0_RegFile_REG_FILE_reg[4][4]/CK} {U0_RegFile_REG_FILE_reg[4][5]/CK} {U0_RegFile_REG_FILE_reg[4][6]/CK} {U0_RegFile_REG_FILE_reg[4][7]/CK} {U0_RegFile_REG_FILE_reg[5][0]/CK} {U0_RegFile_REG_FILE_reg[5][1]/CK} {U0_RegFile_REG_FILE_reg[5][2]/CK} {U0_RegFile_REG_FILE_reg[5][3]/CK} {U0_RegFile_REG_FILE_reg[5][4]/CK} {U0_RegFile_REG_FILE_reg[5][5]/CK} {U0_RegFile_REG_FILE_reg[5][6]/CK} {U0_RegFile_REG_FILE_reg[5][7]/CK} {U0_RegFile_REG_FILE_reg[6][0]/CK} {U0_RegFile_REG_FILE_reg[6][1]/CK} {U0_RegFile_REG_FILE_reg[6][2]/CK} {U0_RegFile_REG_FILE_reg[6][3]/CK} {U0_RegFile_REG_FILE_reg[6][4]/CK} {U0_RegFile_REG_FILE_reg[6][5]/CK} {U0_RegFile_REG_FILE_reg[6][6]/CK} {U0_RegFile_REG_FILE_reg[6][7]/CK} {U0_RegFile_REG_FILE_reg[7][0]/CK} {U0_RegFile_REG_FILE_reg[7][1]/CK} {U0_RegFile_REG_FILE_reg[7][2]/CK} {U0_RegFile_REG_FILE_reg[7][3]/CK} {U0_RegFile_REG_FILE_reg[7][4]/CK} {U0_RegFile_REG_FILE_reg[7][5]/CK} {U0_RegFile_REG_FILE_reg[7][6]/CK} {U0_RegFile_REG_FILE_reg[7][7]/CK} {U0_RegFile_REG_FILE_reg[8][0]/CK}}]
append_to_collection __coll_2 [get_pins {{U0_RegFile_REG_FILE_reg[8][1]/CK} {U0_RegFile_REG_FILE_reg[8][2]/CK} {U0_RegFile_REG_FILE_reg[8][3]/CK} {U0_RegFile_REG_FILE_reg[8][4]/CK} {U0_RegFile_REG_FILE_reg[8][5]/CK} {U0_RegFile_REG_FILE_reg[8][6]/CK} {U0_RegFile_REG_FILE_reg[8][7]/CK} {U0_RegFile_REG_FILE_reg[9][0]/CK} {U0_RegFile_REG_FILE_reg[9][1]/CK} {U0_RegFile_REG_FILE_reg[9][2]/CK} {U0_RegFile_REG_FILE_reg[9][3]/CK} {U0_RegFile_REG_FILE_reg[9][4]/CK} {U0_RegFile_REG_FILE_reg[9][5]/CK} {U0_RegFile_REG_FILE_reg[9][6]/CK} {U0_RegFile_REG_FILE_reg[9][7]/CK} {U0_RegFile_REG_FILE_reg[10][0]/CK} {U0_RegFile_REG_FILE_reg[10][1]/CK} {U0_RegFile_REG_FILE_reg[10][2]/CK} {U0_RegFile_REG_FILE_reg[10][3]/CK} {U0_RegFile_REG_FILE_reg[10][4]/CK} {U0_RegFile_REG_FILE_reg[10][5]/CK} {U0_RegFile_REG_FILE_reg[10][6]/CK} {U0_RegFile_REG_FILE_reg[10][7]/CK} {U0_RegFile_REG_FILE_reg[11][0]/CK} {U0_RegFile_REG_FILE_reg[11][1]/CK} {U0_RegFile_REG_FILE_reg[11][2]/CK} {U0_RegFile_REG_FILE_reg[11][3]/CK} {U0_RegFile_REG_FILE_reg[11][4]/CK} {U0_RegFile_REG_FILE_reg[11][5]/CK} {U0_RegFile_REG_FILE_reg[11][6]/CK} {U0_RegFile_REG_FILE_reg[11][7]/CK} {U0_RegFile_REG_FILE_reg[12][0]/CK} {U0_RegFile_REG_FILE_reg[12][1]/CK} {U0_RegFile_REG_FILE_reg[12][2]/CK} {U0_RegFile_REG_FILE_reg[12][3]/CK} {U0_RegFile_REG_FILE_reg[12][4]/CK} {U0_RegFile_REG_FILE_reg[12][5]/CK} {U0_RegFile_REG_FILE_reg[12][6]/CK} {U0_RegFile_REG_FILE_reg[12][7]/CK} {U0_RegFile_REG_FILE_reg[13][0]/CK} {U0_RegFile_REG_FILE_reg[13][1]/CK} {U0_RegFile_REG_FILE_reg[13][2]/CK} {U0_RegFile_REG_FILE_reg[13][3]/CK} {U0_RegFile_REG_FILE_reg[13][4]/CK} {U0_RegFile_REG_FILE_reg[13][5]/CK} {U0_RegFile_REG_FILE_reg[13][6]/CK} {U0_RegFile_REG_FILE_reg[13][7]/CK} {U0_RegFile_REG_FILE_reg[14][0]/CK} {U0_RegFile_REG_FILE_reg[14][1]/CK} {U0_RegFile_REG_FILE_reg[14][2]/CK} {U0_RegFile_REG_FILE_reg[14][3]/CK} {U0_RegFile_REG_FILE_reg[14][4]/CK} {U0_RegFile_REG_FILE_reg[14][5]/CK} {U0_RegFile_REG_FILE_reg[14][6]/CK} {U0_RegFile_REG_FILE_reg[14][7]/CK} {U0_RegFile_REG_FILE_reg[15][0]/CK} {U0_RegFile_REG_FILE_reg[15][1]/CK} {U0_RegFile_REG_FILE_reg[15][2]/CK} {U0_RegFile_REG_FILE_reg[15][3]/CK} {U0_RegFile_REG_FILE_reg[15][4]/CK} {U0_RegFile_REG_FILE_reg[15][5]/CK} {U0_RegFile_REG_FILE_reg[15][6]/CK} {U0_RegFile_REG_FILE_reg[15][7]/CK} {U0_RegFile_RdData_reg[0]/CK} {U0_RegFile_RdData_reg[1]/CK} {U0_RegFile_RdData_reg[2]/CK} {U0_RegFile_RdData_reg[3]/CK} {U0_RegFile_RdData_reg[4]/CK} {U0_RegFile_RdData_reg[5]/CK} {U0_RegFile_RdData_reg[6]/CK} {U0_RegFile_RdData_reg[7]/CK} U0_RegFile_RdValid_reg/CK {U0_SYS_CTRL_Current_State_reg[0]/CK} {U0_SYS_CTRL_Current_State_reg[1]/CK} {U0_SYS_CTRL_Current_State_reg[3]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[0]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[1]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[2]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[3]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[4]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[5]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[6]/CK} {U0_SYS_CTRL_RX_P_DATA_reg_reg[7]/CK} {U0_SYS_CTRL_W_add_reg_reg[0]/CK} {U0_SYS_CTRL_W_add_reg_reg[1]/CK} {U0_SYS_CTRL_W_add_reg_reg[2]/CK} {U0_SYS_CTRL_W_add_reg_reg[3]/CK} {U0_UART_RX_UNIT_U_FSM_Current_state_reg[1]/CK} {U0_UART_RX_UNIT_U_FSM_Current_state_reg[2]/CK} U0_UART_RX_UNIT_U_Par_check_parity_error_reg/CK {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[0]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[1]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[2]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[3]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[4]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[5]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[6]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg[7]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[0]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[1]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[2]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[3]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[4]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[5]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[6]/CK} {U0_UART_RX_UNIT_U_desrial_P_DATA_reg_reg[7]/CK} {U0_UART_RX_UNIT_U_desrial_counter_reg[0]/CK} {U0_UART_RX_UNIT_U_desrial_counter_reg[1]/CK} {U0_UART_RX_UNIT_U_desrial_counter_reg[2]/CK} {U0_UART_RX_UNIT_U_desrial_counter_reg[3]/CK} {U0_UART_RX_UNIT_U_edge_counter_bit_cnt_reg[1]/CK} {U0_UART_RX_UNIT_U_edge_counter_bit_cnt_reg[3]/CK} {U0_UART_RX_UNIT_U_edge_counter_edge_cnt_reg[0]/CK} {U0_UART_RX_UNIT_U_edge_counter_edge_cnt_reg[1]/CK} {U0_UART_RX_UNIT_U_edge_counter_edge_cnt_reg[2]/CK} U0_UART_RX_UNIT_U_sampler_sampled_bit_reg/CK {U0_UART_RX_UNIT_U_sampler_sampled_data_reg[0]/CK} {U0_UART_RX_UNIT_U_sampler_sampled_data_reg[1]/CK} U0_UART_RX_UNIT_U_stop_chk_stop_error_reg/CK {U0_UART_TX_UNIT_FSM_Current_state_reg[0]/CK} {U0_UART_TX_UNIT_FSM_Current_state_reg[2]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[0]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[1]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[2]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[3]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[4]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[5]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[6]/CK} {U0_UART_TX_UNIT_SER_P_DATA_reg_reg[7]/CK} {U0_UART_TX_UNIT_SER_counter_reg[0]/CK} {U0_UART_TX_UNIT_SER_counter_reg[1]/CK} U0_UART_TX_UNIT_SER_ser_data_reg/CK U0_UART_TX_UNIT_SER_ser_done_reg/CK U0_UART_TX_UNIT_parity_calc_Par_bit_reg/CK U0_ref_Data_sync_U_PULSE_GEN_reg_SIG_0_reg/CK U0_ref_Data_sync_U_PULSE_GEN_reg_SIG_1_reg/CK {U0_ref_Data_sync_sync_bus_reg[0]/CK} {U0_ref_Data_sync_sync_bus_reg[1]/CK} {U0_ref_Data_sync_sync_bus_reg[2]/CK} {U0_ref_Data_sync_sync_bus_reg[3]/CK} {U0_ref_Data_sync_sync_bus_reg[4]/CK} {U0_ref_Data_sync_sync_bus_reg[5]/CK} {U0_ref_Data_sync_sync_bus_reg[6]/CK} {U0_ref_Data_sync_sync_bus_reg[7]/CK} {U1_ClkDiv_counter_reg[0]/CK} {U1_ClkDiv_counter_reg[1]/CK} {U1_ClkDiv_counter_reg[2]/CK} {U1_ClkDiv_counter_reg[3]/CK} {U1_ClkDiv_counter_reg[4]/CK} {U1_ClkDiv_counter_reg[5]/CK} {U1_ClkDiv_counter_reg[6]/CK} {U1_ClkDiv_counter_reg[7]/CK} U1_ClkDiv_div_clk_reg/CK {U0_ASYNC_FIFO_U_FIFO_RD_inter_addr_reg[1]/CK} {U0_RegFile_REG_FILE_reg[0][3]/CK} {U0_RegFile_REG_FILE_reg[0][5]/CK} {U0_RegFile_REG_FILE_reg[0][7]/CK} {U0_RegFile_REG_FILE_reg[1][0]/CK} {U0_RegFile_REG_FILE_reg[1][1]/CK} {U0_RegFile_REG_FILE_reg[1][2]/CK} {U0_RegFile_REG_FILE_reg[1][3]/CK} {U0_RegFile_REG_FILE_reg[1][5]/CK} {U0_RegFile_REG_FILE_reg[2][0]/CK} {U0_SYS_CTRL_Current_State_reg[2]/CK} {U0_UART_RX_UNIT_U_FSM_Current_state_reg[0]/CK} {U0_UART_RX_UNIT_U_edge_counter_bit_cnt_reg[0]/CK} {U0_UART_RX_UNIT_U_edge_counter_bit_cnt_reg[2]/CK} {U0_UART_RX_UNIT_U_edge_counter_edge_cnt_reg[3]/CK} {U0_UART_RX_UNIT_U_edge_counter_edge_cnt_reg[4]/CK} {U0_UART_RX_UNIT_U_sampler_counter_reg[0]/CK} {U0_UART_RX_UNIT_U_sampler_counter_reg[1]/CK} U0_UART_RX_UNIT_U_start_chk_start_glitch_reg/CK {U0_UART_TX_UNIT_FSM_Current_state_reg[1]/CK} {U0_UART_TX_UNIT_SER_counter_reg[2]/CK} U0_ref_Data_sync_enable_pulse_reg/CK {U0_RegFile_REG_FILE_reg[1][4]/CK} {U0_RegFile_REG_FILE_reg[1][6]/CK}}]
set_max_delay 14  -from $__coll_2   -to [get_ports {UART_TX_O parity_error framing_error}] 
set_false_path  -from [get_ports {RST_N}] 
set_clock_uncertainty  0.01 [get_ports {REF_CLK}]
set_clock_groups -name Functional_Clocks -asynchronous  -group  [get_clocks {UART_TX_CLK UART_RX_CLK}] -group  [get_clocks {REF_CLK ALU_CLK}]
